perf/root.yaml
config:
  environments:
    api:
      #target: 'http://localhost:5555/api'
      target: 'http://localhost:3000'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Ramp
      duration: 30
      arrivalRate: 1
      rampTo: 5
    - name: Plain
      duration: 60
      arrivalRate: 5
    

scenarios:
  - name: Ping (/ping)
    flow:
      - get:
          url: '/ping'
  # - name: Some endpoints
  #   flow:
  #     - get:
  #         url: '/dictionary?word=<word>'
  #     - get:
  #         url: '/ping'
  #     - get: 
  #         url: '/spaceflight_news'
  # - name: Dictionary
  #   flow:
  #     - get:
  #         url: '/dictionary?word=word'
  # - name: Spaceflight news y quote
  #   flow:
  #     - get:
  #         url: '/spaceflight_news'
  #     - get:
  #         url: '/quote'
  # - name: Dictionary some
  #   flow:
  #     - get:
  #         url: '/dictionary?word=hello'
  #     - get:
  #         url: '/dictionary?word=bye'
  #     - get:
  #         url: '/dictionary?word=tree'
  # - name: Quote some
  #   flow:
  #     - get:
  #         url: '/quote'
  #     - get:
  #         url: '/quote'
  #     - get:
  #         url: '/quote'
  # - name: Spaceflight news some
  #   flow:
  #     - get:
  #         url: '/spaceflight_news'
  #     - get:
  #         url: '/spaceflight_news'
  #     - get:
  #         url: '/spaceflight_news'